# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [19]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [20]:
s1 = pd.Series(np.random.randint(1,5,100))
s2 = pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,30001,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [21]:
housemkt = pd.concat([s1,s2,s3], axis=1)
housemkt.head()

   0  1      2
0  3  2  18992
1  2  1  20706
2  1  3  20838
3  2  3  22204
4  4  1  14428

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [22]:
housemkt.rename(columns = {0:'bedrs', 1:'bathrs', 2:'price_sqr_meter'}, inplace=True)

In [23]:
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            18992
1      2       1            20706
2      1       3            20838
3      2       3            22204
4      4       1            14428

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [27]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)

In [28]:
bigcolumn = bigcolumn.to_frame()

In [29]:
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [30]:
bigcolumn

        0
0       3
1       2
2       1
3       2
4       4
..    ...
95  18968
96  12460
97  23528
98  12876
99  11517

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [32]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [34]:
bigcolumn.reset_index(drop=True, inplace=True)

In [35]:
bigcolumn

         0
0        3
1        2
2        1
3        2
4        4
..     ...
295  18968
296  12460
297  23528
298  12876
299  11517

[300 rows x 1 columns]